Basics

In [5]:
import pandas as pd

data = pd.read_csv('/data/restaurants.tsv', delimiter='\t')
data.head()

,id,name,address,city,phone,type
0,1,arnie morton's of chicago,435 s. la cienega blv.,los angeles,310/246-1501,american
1,2,arnie morton's of chicago,435 s. la cienega blvd.,los angeles,310-246-1501,steakhouses
2,3,art's delicatessen,12224 ventura blvd.,studio city,818/762-1221,american
3,4,art's deli,12224 ventura blvd.,studio city,818-762-1221,delis
4,5,hotel bel-air,701 stone canyon rd.,bel air,310/472-1211,californian

In [6]:
data.describe()

               id
count  864.000000
mean   432.500000
std    249.559612
min      1.000000
25%    216.750000
50%    432.500000
75%    648.250000
max    864.000000

In [7]:
data.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 864 entries, 0 to 863
Data columns (total 6 columns):
id         864 non-null int64
name       864 non-null object
address    864 non-null object
city       864 non-null object
phone      864 non-null object
type       863 non-null object
dtypes: int64(1), object(5)
memory usage: 40.6+ KB

In [15]:
ucities = data.city.unique()
ucities.sort()
ucities

array(['atlanta', 'bel air', 'beverly hills', 'brentwood', 'brooklyn',
       'burbank', 'century city', 'chinatown', 'college park',
       'culver city', 'decatur', 'duluth', 'encino', 'glendale',
       'hollywood', 'la', 'las vegas', 'long beach', 'los angeles',
       'los feliz', 'malibu', 'manhattan beach', 'mar vista', 'marietta',
       'marina del rey', 'monterey park', 'new york', 'new york city',
       'northridge', 'pacific palisades', 'pasadena', 'queens',
       'rancho park', 'redondo beach', 'roswell', 'san francisco',
       'santa monica', 'seal beach', 'sherman oaks', 'smyrna',
       'st. boyle hts.', 'st. hermosa beach', 'studio city',
       'toluca lake', 'venice', 'w. hollywood', 'west la',
       'westlake village', 'westwood'], dtype=object)

In [20]:
# Return the Hamming distance between string1 and string2.
# string1 and string2 should be the same length.
def hamming_distance(string1, string2): 
    # Start with a distance of zero, and count up
    distance = 0
    # Loop over the indices of the string
    L = len(string1)
    for i in range(L):
        # Add 1 to the distance if these two characters are not equal
        if string1[i] != string2[i]:
            distance += 1
    # Return the final count of differences
    return distance